<template lang="html">
    <div class="apply-cons">
        <div class="greet">
            <p class="enter">亲爱的用户：{{loginName}}，欢迎入驻鲜易网</p>
            <div class="con-text">
                <div class="letterCommitment">
                    <h3>网络食品安全交易承诺书</h3>
                    <p>鉴于国家对食品等产品质量要求高，现双方针对鲜易网入驻商家网络食品安全交易作出以下规定：</p>
                    <p class="big-title">一、产品质量标准</p>
                    <p>1、入驻商家应当认真学习《网络食品安全违法行为查处办法》、《网络交易管理办法》、《中华人民共和国食品安全法》、《产品标识标注规定》、《加强食品质量安全监督管理工作实施意见》、《食品召回管理规定》等法律法规以及鲜易网相关制度、标准和平台规则，并承诺将严格遵守各项法律法规、平台制度、双方协议，维护互联网平台秩序，保护消费者权益。</p>
                    <p>2、入驻商家应当保证其所提供产品及其原料、添加剂等各项指标符合法律法规规定。产品有国家标准、行业标准的，必须执行；没有国家标准或行业标准的，执行通用地方标准和的企业标准。标准不一致的，以标准最高者为准。</p>
                    <p>3、入驻商家应当确保具备符合产品质量的环境条件、生产设备和相关辅助设备，严格按照合GB 14881规定及相关规范及标准进行产品生产经营。入驻商家应当防止食品交叉感染，对生产、加工、分拣等关键点进行严格控制。</p>
                    <p>4、入驻商家应当建立食品及原辅料的出入库查验记录制度，如实记录食品的名称、数量、生产批号、保质期、供货者名称及联系方式、出入库日期等内容，并确保相关票据信息等保存期限不得少于保质期满后半年，质保期不明的不得少于两年。入驻商家确保将每批产品可溯源，有合格证等证件备查。否则由入驻商家承担由此造成的损失和法律责任。</p>
                    <p>5、入驻商家提供的所有产品必须清洁、整齐、包装完好、适宜销售，不得有任何外包装损坏、潮湿、变色、污染等影响商品销售的问题。产品包装应当符合法律法规要求，包括但不限于产品商标、名称、配料、生产日期、保质期等信息。产品有特殊保质期、使用方法、储存要求的要显著标示。同时，入驻商家免费授权鲜易网在包装物上标注鲜易网相关标示。</p>
                    <p>6、入驻商家应当确保线上产品明示相关储存和运输方式、产品信息、保质期等内容，保证鲜易网上产品所显示信息与实际标签标注、库存量等一致，对于信息缺失或错误的应当及时通知鲜易网。</p>
                    <p>7、如入驻商家需要对产品仓储运输的，入驻商家应当对产品采取保鲜、保温、冷藏或冷冻等符合食品安全的贮存、运输措施，或者委托具备相应贮存、配送能力的企业。如果由于储运过程导致产品质量问题的，由入驻商家与仓储方或运输方承担连带责任。</p>
                    <p class="big-title"> 二、合法经营要求</p>
                    <p>1、入驻商家应当积极维护互联网秩序，进行合法竞争，不得扰乱市场价格，不得有虚假交易，不得虚构货源，不得欺诈消费者或进行违法有奖销售，不得作出垄断市场、滥用市场支配地位等扰乱市场秩序的行为。</p>
                    <p>2、入驻商家保证经营合法合规产品，保证产品在经营许可范围内。不得销售假冒伪劣产品，不得在产品中掺杂、掺假、以假充真、以次充好、以不合格品冒充合格品，不得使用非食品原料、回收食品、发霉变质原料加工食品，不得销售临期、过期产品。</p>
                    <p>3、入驻商家确保享有产品所有权、产品商标以及广告语的使用权和再授权、产品分销和零售权利等。入驻商家确保不存在侵犯任何第三方的合法权益的情况，否则由入驻商家负责处理相关纠纷，赔偿相关损失。</p>
                    <p>4、入驻商家应当真实合法宣传，不发布任何涉嫌违法违规的内容，不做虚假夸大宣传，不仿冒他人商标、标示、驰名商标、广告语等，对婴幼儿乳粉、保健品、进口产品等特殊产品合法标示，不得使用禁止广告语。同时不得以鲜易网名义对外开展合作事项。</p>
                    <p>5、入驻商家应当对消费者信息、交易信息等保密，保证网络经营安全，不随意泄露账户信息，做好交易数据备份保留，对于网络安全事件的要积极采取措施防止损害扩大。</p>
                    <p>6、严厉禁止入驻商家代替消费者下单或者入驻商家进行刷单等伪造订单数据的行为，否则鲜易网有权对入驻商家予以处罚。</p>
                    <p>7、入驻商家应当严格落实网店“实名制”，确保所提供提供的电话、地址、资质证件等联证实有效，能够及时收取消费者信息。积极履行售后服务义务，妥善处理消费者投诉，接受消费者监督。</p>
                    <p>8、入驻商家如出现公司因食品安全问题涉嫌违法违规，被相关机关侦查、起诉、刑罚、治安处罚、吊销执照或停产停业等情形，应当第一时间通知鲜易网，并积极配合相关部门的调查。鲜易网可以根据情节严重性对入驻商家产品下架或与入驻商家解除合同。</p>
                    <p>9、入驻商家应当配合鲜易网行使先行赔付义务，当入驻商家产品交易过程中导致消费者权益受损，消费者有权在交易成功后向鲜易网发起投诉，并提出赔付申请。当鲜易网根据相关规则判定消费者赔付申请成立，则有权直接扣除入驻商家相应金额款项赔付给消费者。如果确实赔付有错误的，鲜易网可以配合入驻商家对消费者进行追偿。</p>
                    <p class="big-title">三、平台监督义务</p>
                    <p>1、鲜易网应当对对入驻商家相关资质证件进行审核，并要求入驻商家提供相关产品的质量检测报告、合格证等材料，以审查入驻商家主体合法性和入驻商家产品质量状况。</p>
                    <p>2、鲜易网可以要求入驻商家对销售产品进行备案，对每批产品要求入驻商家备案出厂检验报告、检疫标签、产品合格证等证件，同时可以要求入驻商&nbsp; &nbsp; &nbsp;&nbsp; 家提供产品包装的样本（电子档图片），并依据包装上标注的内容，提供相关产品生产标准、相关证明等。</p>
                    <p>3、鲜易网可以要求入驻商家提供其产品质量管理制度或产品生产经营标准，以供备案。或者由鲜易网指定的机构为入驻商家制定相关制度和标准，由入驻商家严格按照执行。</p>
                    <p>4、鲜易网有权对入驻商家生产经营场所（经营场所、操作人员、软硬件设施等）不定期现场审核或委托第三方机构现场审核，针对鲜易网及委托审核机构审核发现的问题，入驻商家应当及时整改。</p>
                    <p>5、在平台经营过程中，鲜易网接受政府有关职能部门的监督检查，入驻商家应积极配合调查处理工作，由于入驻商家商品（服务）质量原因引起的处罚，由入驻商家承担全部责任，并赔偿鲜易网全部损失。如鲜易网接受政府部门抽样检测，其抽检样品及检测费用由入驻商家无偿提供。同时鲜易网有权对入驻商家产品进行抽样检测、监督或送至双方共同制定的第三方检测机构进行检测，同时，入驻商家认可鲜易网根据检验结果而采取的相应措施。</p>
                    <p>6、鲜易网可以要求入驻商家针对双方合作产品，每年提供至少两次官方检测机构出具的质检报告或产品质量合格证明。/p>
                    <p class="big-title">四、处罚措施</p>
                    <p>1、如果入驻商家提供的商品存在问题，包括但不限于违反以上产品标准、违反以上合法经营要求、包装问题（如配料表、规格、QS号、保质期等内外包装标注不一致）、食品缺项（如贮存条件、商品等级、无营养成分、未标注固形物）、食品标注项目错误（如保质期、执行标准等）、非食品标注缺项（材质、标准等）、赠品包装标注不合格、涉嫌侵权、虚假宣传（非食品）、过期使用、质量安全、广告宣传问题（包括但不限于宣传功效、绝对化用语、专供等），从而遭到顾客投诉、行政机关查处、第三方主张权利或相关部门抽查及复查商品质量不合格的，由入驻商家承担由此产生的一切法律责任，并赔偿鲜易网和消费者由此所造成的损失。</p>
                    <p>2、入驻商家如果出现以上问题的，应当按照鲜易网“鲜易网”平台相关产品价值的十倍向鲜易网支付违约金，或者按照违约问题个数支付100元/个的违约金。</p>
                    <p>3、如入驻商家所提供的产品或服务未达到消费者需求，导致入驻商家被投诉的（包括电话投诉或官方投诉），入驻商家应当负责解决投诉问题，如投诉得到有效解决，且未造成鲜易网损失的，鲜易网可以不予追究入驻商家相关责任，如投诉未得到有效解决的需支付 500 元/次违约金。</p>
                    <p>4、如果入驻商家产品问题或入驻商家违法法律法规，导致鲜易网被政府机关处罚或媒体曝光造成名誉受损的的，入驻商家应当负责处理相关问题，并赔偿鲜易网全部损失，支付鲜易网不低于五万元的违约金。鲜易网可以根据相关具体问题做出处理方案，入驻商家应当无条件配合方案实施。</p>
                    <p>5、对于入驻商家出现产品或服务不符合承诺书内容或者其他违反双方约定情形的，甲方可以采取以下措施：发出整改通知，要求入驻商家在规定的期限内进行整改，逾期不整改的加重处罚；要求入驻商家召回产品；要求入驻商家及时退换货并赔偿损失；要求入驻商家公开道歉；下架相关产品；暂时关闭入驻商家后台管理账户；暂停款项结算；扣除部分或者全部保证金；终止双方合作；由入驻商家赔偿由此造成的鲜易网以及消费者所造成的直接和间接损失；对入驻商家进行罚款等措施。鲜易网可以采取以上一种或多种措施，入驻商家如果对鲜易网的处罚措施有争议的，应当于鲜易网发出处罚通知后24小时内书面向鲜易网提出争议理由，否则视为接受。</p>
                    <p>6、除以上措施以外，鲜易网可以行使双方其他合同、附件、补充协议、平台规则、中或者鲜易网规范性文件中所约定的处罚措施。</p>
                </div>
            </div>
            <el-form>
                <el-form-item class="consentInt">
                    <el-checkbox class="consent" v-model="checkBtn">同意《网络食品安全交易承诺书》</el-checkbox>
                </el-form-item>
                <div class="con-totton">
                    <el-button type="primary" :disabled="disabled" @click="linkToData">确定并下一步</el-button>
                    <el-button @click="linkToLogin">返回至供应商登录</el-button>
                    <el-button @click="dialogTableVisible = true">入驻教程</el-button>
                </div>
            </el-form>
        </div>
        <el-dialog class="el-dialog-jiaoc" title="" :visible.sync="dialogTableVisible">
            <div>
                <img src="../../../assets/images/imgtc_01.jpg" alt="">
            </div>
            <div slo="footer" style="text-align: center; margin-top: 30px;">
                <el-button class="xe-button-normal" @click="dialogTableVisible = false">关闭</el-button>
            </div>
        </el-dialog>
    </div>
</template>
<style lang="scss">
    .el-dialog-jiaoc {
        .el-dialog {
            width: 1000px;
            img {
                width: 960px;
            }
        }
    }
    .con-text{
        width: 1000px;
        border:1px solid #ced5de;
        border-top:4px solid #ced5de;
        height: 360px;
        overflow :auto;
    }
    .letterCommitment{
        padding:20px 66px 0 66px;
    }
    .letterCommitment h3{
        font-size: 20px;
        text-align: center;
        line-height: 35px;
    }
    .letterCommitment p{
        font-size: 13px;
        line-height: 26px;
        text-indent: 2em;
    }
    .consentInt{
        margin-bottom: 20px;
    }
    .consent{
        margin-top: 12px;
    }
    .greet .con-text{
        margin-top: 10px;
    }
</style>
<script>
    import {getNowCookie, resetUserInfoCookie} from 'utils/commonBase';
    export default {
        name: 'applyAccount',
        beforeRouteEnter(to, from, next) {
            let nowCookie = getNowCookie();
            let userInfo = nowCookie.userInfo;
            switch (userInfo.code) {
                case 1 :
                    // 待审核
                    next({
                        name: 'applyResult',
                        params: {
                            typeId: 1
                        }
                    });
                    break;
                case 2 :
                    // 审核通过
                    next({
                        name: 'applyResult',
                        params: {
                            typeId: 2
                        }
                    });
                    break;
                case 3 :
                    // 驳回
                    next({
                        name: 'applyResult',
                        params: {
                            typeId: 3
                        }
                    });
                    break;
                case 4 :
                    // 已签订
                    next({
                        name: 'index'
                    });
                    break;
                default :
                    // 未入住
                    next();
            }
        },
        data() {
            return {
                checkBtn: false,
                dialogTableVisible: false,
                loginName: ''
            };
        },
        created() {
            let nowCookie = getNowCookie();
            this.loginName = nowCookie.userInfo.loginName;
        },
        methods: {
            linkToData() {
                resetUserInfoCookie({code: 6});
                this.$router.push({name: 'applyData'});
            },
            linkToLogin() {
                this.$router.push({name: 'login'});
            }
        },
        computed: {
            disabled() {
                let disabledFlag = true;
                if (this.checkBtn) {
                    disabledFlag = false;
                } else {
                    disabledFlag = true;
                }
                return disabledFlag;
            }
        }

    };
</script>
